W8D1/reddit_clone/app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    @post.author_id = current_user.id

    if @post.save
---
INSERT INTO "posts" ("title", "content", "created_at", "updated_at", "sub_id", "author_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "rthrtshsrth"], ["content", "srhtsrth"], ["created_at", "2020-07-20 23:49:18.147988"], ["updated_at", "2020-07-20 23:49:18.147988"], ["sub_id", 7], ["author_id", 4]]