W8D1/reddit_clone/app/controllers/subs_controller.rb

    def destroy
        @sub = current_user.subs.find_by(id: params[:id])
        if @sub
            @sub.destroy
---
SELECT  "subs".* FROM "subs" WHERE "subs"."user_id" = $1 AND "subs"."id" = $2 LIMIT $3  [["user_id", 4], ["id", 2], ["LIMIT", 1]]
DELETE FROM "subs" WHERE "subs"."id" = $1  [["id", 2]]

    def edit
      @sub = current_user.subs.find_by(id: params[:id])
---
SELECT  "subs".* FROM "subs" WHERE "subs"."user_id" = $1 AND "subs"."id" = $2 LIMIT $3  [["user_id", 4], ["id", 6], ["LIMIT", 1]]

    def update
      @sub = current_user.subs.find_by(id: params[:id])
      if @sub.update(sub_params)
---
SELECT  "subs".* FROM "subs" WHERE "subs"."user_id" = $1 AND "subs"."id" = $2 LIMIT $3  [["user_id", 4], ["id", 6], ["LIMIT", 1]]
UPDATE "subs" SET "description" = $1, "updated_at" = $2 WHERE "subs"."id" = $3  [["description", "A news forum!"], ["updated_at", "2020-07-20 22:09:20.137411"], ["id", 6]]