W8D1/reddit_clone/app/views/users/show.html.erb

SELECT "subs".* FROM "subs" WHERE "subs"."user_id" = $1  [["user_id", 1]]
---
  <h2>Subs List</h2>
  <% @user.subs.each do |sub| %>