W8D1/reddit_clone/app/views/subs/show.html.erb

  <h2>Posts</h2>
  <% @sub.posts.each do |post| %>
---
SELECT "posts".* FROM "posts" WHERE "posts"."sub_id" = $1  [["sub_id", 6]]

      <li> <%= post.title %> </li>
      <li> Author: <%= User.find(post.author_id).username %> </li>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]